In [1]:
import pandas as pd
import numpy as np

# 1. DataFrame에 새 행 추가

In [2]:
# 주어진 DataFrame

s1 = pd.Series([1,2,3])
s2 = pd.Series(['a','b','c'])

df = pd.DataFrame([list(s1), list(s2)], columns=['C1','C2','C3'])

  C1 C2 C3
0  1  2  3
1  a  b  c

In [3]:
df

  C1 C2 C3
0  1  2  3
1  a  b  c

In [4]:
print(df)

  C1 C2 C3
0  1  2  3
1  a  b  c

In [5]:
# 새 행을 추가 [10,11,12]

df = pd.DataFrame(np.array([[10,11,12]]), columns=['C1','C2','C3']).append(df, ignore_index=True)

In [6]:
df

   C1  C2  C3
0  10  11  12
1   1   2   3
2   a   b   c

In [7]:
print(df)

   C1  C2  C3
0  10  11  12
1   1   2   3
2   a   b   c

# 2. DataFrame에서 행 삭제 / 삭제

In [8]:
# DataFrame 생성

df = pd.DataFrame(np.arange(10).reshape(5,2), columns=list('ab'))

In [9]:
df

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [10]:
print(df)

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [11]:
# drop([..], inplace=True) 메소드를 사용하여 인덱스가 있는 행을 0과 4를 삭제

df.drop([0, 4], inplace=True)

In [12]:
df

   a  b
1  2  3
2  4  5
3  6  7

In [13]:
print(df)

   a  b
1  2  3
2  4  5
3  6  7

In [20]:
# df = drop([...]) 메소드를 사용하여 인덱스가있는 행을 0 과 4를 삭제

df = pd.DataFrame(np.arange(10).reshape(5,2), columns=list('ab'))

In [21]:
df

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [22]:
print(df)

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [23]:
df.drop([0,4])

   a  b
1  2  3
2  4  5
3  6  7

In [34]:
df = pd.DataFrame(np.arange(10).reshape(5,2), columns=list('ab'))

In [35]:
df

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [32]:
df = df[~df.index.isin([0,4])]

In [33]:
df

   a  b
1  2  3
2  4  5
3  6  7

In [36]:
df = df[df.index.isin([0,4])]

In [37]:
df

   a  b
0  0  1
4  8  9

# 3. DataFrame의 열 삭제

In [52]:
# DataFrame에서 열을 삭제하는데는 몇가지 방법이 있다.

np.random.seed(0)
# rand(5,6) : 행 5개, 열 6개
df = pd.DataFrame(np.random.rand(5,6), columns=list('ABCDEF'))

In [53]:
df

          A         B         C         D         E         F
0  0.548814  0.715189  0.602763  0.544883  0.423655  0.645894
1  0.437587  0.891773  0.963663  0.383442  0.791725  0.528895
2  0.568045  0.925597  0.071036  0.087129  0.020218  0.832620
3  0.778157  0.870012  0.978618  0.799159  0.461479  0.780529
4  0.118274  0.639921  0.143353  0.944669  0.521848  0.414662

In [54]:
print(df)

          A         B         C         D         E         F
0  0.548814  0.715189  0.602763  0.544883  0.423655  0.645894
1  0.437587  0.891773  0.963663  0.383442  0.791725  0.528895
2  0.568045  0.925597  0.071036  0.087129  0.020218  0.832620
3  0.778157  0.870012  0.978618  0.799159  0.461479  0.780529
4  0.118274  0.639921  0.143353  0.944669  0.521848  0.414662

In [55]:
# 1) del 사용

del df['C']

In [56]:
df

          A         B         D         E         F
0  0.548814  0.715189  0.544883  0.423655  0.645894
1  0.437587  0.891773  0.383442  0.791725  0.528895
2  0.568045  0.925597  0.087129  0.020218  0.832620
3  0.778157  0.870012  0.799159  0.461479  0.780529
4  0.118274  0.639921  0.944669  0.521848  0.414662

In [57]:
print(df)

          A         B         D         E         F
0  0.548814  0.715189  0.544883  0.423655  0.645894
1  0.437587  0.891773  0.383442  0.791725  0.528895
2  0.568045  0.925597  0.087129  0.020218  0.832620
3  0.778157  0.870012  0.799159  0.461479  0.780529
4  0.118274  0.639921  0.944669  0.521848  0.414662

In [59]:
# 2. drop 사용

df.drop(['B','E'], axis='columns', inplace=True)
# or df.drop(['B','E'], axis=1)

In [60]:
df

          A         D         F
0  0.548814  0.544883  0.645894
1  0.437587  0.383442  0.528895
2  0.568045  0.087129  0.832620
3  0.778157  0.799159  0.780529
4  0.118274  0.944669  0.414662

In [61]:
print(df)

          A         D         F
0  0.548814  0.544883  0.645894
1  0.437587  0.383442  0.528895
2  0.568045  0.087129  0.832620
3  0.778157  0.799159  0.780529
4  0.118274  0.944669  0.414662

In [62]:
# 3. 열 번호에 drop 사용하기
#    이름 대신에 열 정수를 사용하려면 ( 열 인덱스가 0에서 시작함을 기억해라)

df.drop(['A','F'], axis='columns')

          D
0  0.544883
1  0.383442
2  0.087129
3  0.799159
4  0.944669